# Logs | easy | forensics

## Информация
> После проведения DOS атаки, был выгружен дамп логов.

## Выдать участинкам
файл [attackLog.txt](public/attackLog.txt)

## Описание
Нужно найти особые запросы, в url строке будет по-буквенно написан флаг

## Решение
Стоит обратить внимание на запросы, содержащие слово flag. В качестве ссылки используется: `flag.php/{Символ из Флага}`. Далее можно написать программу команды для терминала, которая сама соберёт флаг: `cat log.txt | grep flag | python3 -c "import sys;print(''.join([i.split('flag.php/')[1].split()[0] for i in sys.stdin]))"`.

## Флаг
`ctf{4n4lyz1n6_7h3_w3b_l06}`
